controllers/SiteController.php

    public function actionIndex() {
        $model = new Links();
        $data = Yii::$app->request->post();
        if(Yii::$app->request->isAjax){
            $create_short = $model->short($data['Links']['shorted_link']);
            return $create_short;
        }
        if($header = ltrim(Yii::$app->request->url, '/')) {
            if($findUrl = $model::find()->where(['short_code' => $header])->one()){
---
SELECT * FROM `links` WHERE `short_code`='GXjWEFLQ'