views/site/index.php

SELECT * FROM `links`
---
use yii\bootstrap4\Html;
use app\models\Links;
$this->title = 'Тестовое задание';
$links = Links::find()
    ->indexBy('id')
    ->all();