models/Links.php

    public function short($shorted_link) {
        if($isDouble = Links::find()->where(['shorted_link' => $shorted_link])->one()) {
            $short_code = $isDouble->short_code;
        } else {
            $short_code = $this->randomShortCode();
            $model = new Links();
            $model->month = date('Y')."-".date('m');
            $model->shorted_link = $shorted_link;
            $model->short_code = $short_code;
            $model->cliks = 0;
            $model->top_position = 0;
            $model->save();
---
SELECT * FROM `links` WHERE `shorted_link`='https://www.youtube.com/'
INSERT INTO `links` (`month`, `shorted_link`, `short_code`, `cliks`, `top_position`) VALUES ('2022-07', 'https://www.youtube.com/', 'GXjWEFLQ', 5, 3)

    public function checkIsBot($code){
                $model = Links::find()->where(['short_code' => $code])->one();
                $model->cliks = $model->cliks+1;
                $model->save();
---
SELECT * FROM `links` WHERE `short_code`='GXjWEFLQ'
UPDATE `links` SET `cliks`=6 WHERE `id`=55